# Regression Exercises - Data Wrangling

In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import env

In [2]:
df = pd.read_csv("telco_data.csv")

Let's set up an example scenario as perspective for our regression exercises using the Telco dataset.

As a customer analyst for Telco, you want to know who has spent the most money with the company over their lifetime. You have monthly charges and tenure, so you think you will be able to use those two attributes as features to estimate total charges. You need to do this within an average of $5.00 per customer.

In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Telco data from the telco_churn database in the Codeup database server.

1.) Acquire customer_id, monthly_charges, tenure, and total_charges from the telco_churn database for all customers with a 2-year contract.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  payment_type              7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  contract_type             7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [4]:
df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type,internet_service_type,contract_type
0,0030-FNXPP,Female,0,No,No,3,Yes,No,3,No internet service,...,No internet service,1,No,2,19.85,57.2,No,Mailed check,None,Month-to-month
1,0031-PVLZI,Female,0,Yes,Yes,4,Yes,No,3,No internet service,...,No internet service,1,No,2,20.35,76.35,Yes,Mailed check,None,Month-to-month
2,0098-BOWSO,Male,0,No,No,27,Yes,No,3,No internet service,...,No internet service,1,Yes,1,19.40,529.8,No,Electronic check,None,Month-to-month
3,0107-WESLM,Male,0,No,No,1,Yes,No,3,No internet service,...,No internet service,1,Yes,1,19.85,19.85,Yes,Electronic check,None,Month-to-month
4,0114-RSRRW,Female,0,Yes,No,10,Yes,No,3,No internet service,...,No internet service,1,Yes,3,19.95,187.75,No,Bank transfer (automatic),None,Month-to-month

In [5]:
df.contract_type.value_counts()

Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64

In [6]:
df = df[df.contract_type == 'Two year']

In [7]:
df.columns

Index(['customer_id', 'gender', 'senior_citizen', 'partner', 'dependents',
       'tenure', 'phone_service', 'multiple_lines', 'internet_service_type_id',
       'online_security', 'online_backup', 'device_protection', 'tech_support',
       'streaming_tv', 'streaming_movies', 'contract_type_id',
       'paperless_billing', 'payment_type_id', 'monthly_charges',
       'total_charges', 'churn', 'payment_type', 'internet_service_type',
       'contract_type'],
      dtype='object')

In [8]:
df = df[['customer_id', 'tenure', 'monthly_charges', 'total_charges']]

In [9]:
df.columns

Index(['customer_id', 'tenure', 'monthly_charges', 'total_charges'], dtype='object')

In [10]:
df.total_charges.dtype

dtype('O')

In [11]:
df = df.replace(r'^\s*$', np.nan, regex=True)

In [12]:
df = df.dropna()

In [13]:
df.total_charges = df.total_charges.astype('float64')

**Acquire Takeaways**
- Had to apply a mask on the original df to get only two year contract customers
- Had to drop all columns except customer_id, tenure, monthly_charges, total_charges
- Total_charges had some blank columns making it an object dtype, so I replaced those with 0 to make it a float

2.) Using your acquired Telco data, walk through the summarization and cleaning steps in your wrangle.ipynb file like we did above. You may handle the missing values however you feel is appropriate and meaningful; remember to document your process and decisions using markdown and code commenting where helpful.

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 5348 to 7042
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1685 non-null   object
 1   tenure           1685 non-null   int64
 2   monthly_charges  1685 non-null   float64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
tenure,1685.0,57.071810,17.729130,1.00,48.00,64.00,71.00,72.00
monthly_charges,1685.0,60.872374,34.712210,18.40,24.05,64.45,90.55,118.75
total_charges,1685.0,3728.933947,2571.252806,20.35,1278.80,3623.95,5999.85,8672.45

I think I did everything in number 1.

3.) End with a wrangle.py file that contains the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe with no missing values. Name your final function wrangle_telco.

In [16]:
def wrangle_telco():
    '''
    Read telco_data csv file into a pandas DataFrame,
    only returns two contract customers and desired columns,
    drop any rows with Null values, convert numeric columns to int or float,
    return cleaned telco DataFrame.
    '''
    # Acquire data from csv file.
    df = pd.read_csv("telco_data.csv")
    
    # Apply a mask for contract type
    df = df[df.contract_type == 'Two year']
    
    # Keep only the necessary columns
    df = df[['customer_id', 'tenure', 'monthly_charges', 'total_charges']]
    
    # Replace white space values with NaN values.
    df = df.replace(r'^\s*$', np.nan, regex=True)
    
    # Drop all rows with NaN values.
    df = df.dropna()
    
    # Convert total charges column to float data type.
    df.total_charges = df.total_charges.astype('float64')
    
    return df

In [17]:
df = wrangle_telco()
df.head()

     customer_id  tenure  monthly_charges  total_charges
5348  0040-HALCW      54             20.4        1090.60
5349  0042-RLHYP      69             19.7        1396.90
5350  0057-QBUQH      43             25.1        1070.15
5351  0064-SUDOG      12             20.3         224.50
5352  0071-NDAFP      25             25.5         630.60

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 5348 to 7042
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1685 non-null   object
 1   tenure           1685 non-null   int64
 2   monthly_charges  1685 non-null   float64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

# Challenge

Let's set up an example scenario as perspective for our regression exercises using the Zillow dataset.

As a Codeup data science graduate, you want to show off your skills to the Zillow data science team in hopes of getting an interview for a position you saw pop up on LinkedIn. You thought it might look impressive to build an end-to-end project in which you use some of their Kaggle data to predict property values using some of their available features; who knows, you might even do some feature engineering to blow them away. Your goal is to predict the values of single unit properties using the obervations from 2017.

In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Zillow data from the zillow database in the Codeup database server.

In [19]:
from env import get_db_url, user, password, host
import acquire, wrangle

In [20]:
zillow_df = acquire.get_zillow_db()

In [21]:
zillow_df.head(3)

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0

In [22]:
zillow_df.describe().T

,count,mean,std,min,25%,50%,75%,max
bedroomcnt,2152852.0,3.287196,0.954754,0.00,3.00,3.00,4.00,25.00
bathroomcnt,2152852.0,2.230688,0.999280,0.00,2.00,2.00,3.00,32.00
calculatedfinishedsquarefeet,2144379.0,1862.855178,1222.125124,1.00,1257.00,1623.00,2208.00,952576.00
taxvaluedollarcnt,2152370.0,461896.237963,699676.049600,1.00,188170.25,327671.00,534527.00,98428909.00
yearbuilt,2143526.0,1960.949681,22.162196,1801.00,1949.00,1958.00,1976.00,2016.00
taxamount,2148421.0,5634.865978,8178.910249,1.85,2534.98,4108.95,6414.32,1337755.86
fips,2152863.0,6048.377335,20.433292,6037.00,6037.00,6037.00,6059.00,6111.00

In [23]:
zillow_df.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152863 entries, 0 to 2152862
Data columns (total 7 columns):
 #   Column                        Non-Null Count    Dtype
---  ------                        --------------    -----
 0   bedroomcnt                    2152852 non-null  float64
 1   bathroomcnt                   2152852 non-null  float64
 2   calculatedfinishedsquarefeet  2144379 non-null  float64
 3   taxvaluedollarcnt             2152370 non-null  float64
 4   yearbuilt                     2143526 non-null  float64
 5   taxamount                     2148421 non-null  float64
 6   fips                          2152863 non-null  float64
dtypes: float64(7)
memory usage: 115.0 MB

**Takeaways:**
- a lot of null values
- dtypes are all floats which is good

**Next steps:**
- drop nulls
- drop duplicates

In [24]:
def missing_values_table(df):
    '''
    this function takes a dataframe as input and will output metrics for missing values, and the percent of that column that has missing values
    '''
        # Total missing values
    mis_val = df.isnull().sum()
        # Percentage of missing values
    mis_val_percent = 100 * df.isnull().sum() / len(df)
        # Make a table with the results
    mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
        # Rename the columns
    mis_val_table_ren_columns = mis_val_table.rename(columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        # Sort the table by percentage of missing descending
    mis_val_table_ren_columns = mis_val_table_ren_columns[
    mis_val_table_ren_columns.iloc[:,1] != 0].sort_values('% of Total Values', ascending=False).round(1)
        # Print some summary information
    print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
           "There are " + str(mis_val_table_ren_columns.shape[0]) +
           "columns that have missing values.")
        # Return the dataframe with missing information
    return mis_val_table_ren_columns

In [25]:
missing_values_table(zillow_df)

Your selected dataframe has 7 columns.
There are 6columns that have missing values.

                              Missing Values  % of Total Values
yearbuilt                               9337                0.4
calculatedfinishedsquarefeet            8484                0.4
taxamount                               4442                0.2
taxvaluedollarcnt                        493                0.0
bedroomcnt                                11                0.0
bathroomcnt                               11                0.0

In [26]:
zillow_df.isnull().sum() # count out the nulls. If we drop all the nulls, we'd still have over 2 million entries

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [27]:
zillow_df = zillow_df.dropna()

In [28]:
zillow_df.isnull().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [29]:
zillow_df.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column                        Non-Null Count    Dtype
---  ------                        --------------    -----
 0   bedroomcnt                    2140235 non-null  float64
 1   bathroomcnt                   2140235 non-null  float64
 2   calculatedfinishedsquarefeet  2140235 non-null  float64
 3   taxvaluedollarcnt             2140235 non-null  float64
 4   yearbuilt                     2140235 non-null  float64
 5   taxamount                     2140235 non-null  float64
 6   fips                          2140235 non-null  float64
dtypes: float64(7)
memory usage: 130.6 MB

In [30]:
zillow_df.to_csv('zillow.csv') # cache it to speed up import

In [31]:
zillow_df.describe().T

,count,mean,std,min,25%,50%,75%,max
bedroomcnt,2140235.0,3.301419,0.932600,0.00,3.00,3.00,4.00,25.00
bathroomcnt,2140235.0,2.240352,0.990549,0.00,2.00,2.00,3.00,32.00
calculatedfinishedsquarefeet,2140235.0,1863.193970,1221.754161,1.00,1258.00,1623.00,2208.00,952576.00
taxvaluedollarcnt,2140235.0,460641.625164,677157.635675,22.00,189166.00,328296.00,534606.00,90188462.00
yearbuilt,2140235.0,1960.967545,22.150563,1801.00,1949.00,1958.00,1976.00,2016.00
taxamount,2140235.0,5616.711322,7814.562798,6.34,2540.85,4111.47,6411.93,1078101.87
fips,2140235.0,6048.309556,20.344910,6037.00,6037.00,6037.00,6059.00,6111.00

In [32]:
zillow_df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0
6,3.0,4.0,1620.0,847770.0,2011.0,10244.94,6037.0
7,3.0,2.0,2077.0,646760.0,1926.0,7924.68,6037.0
11,0.0,0.0,1200.0,5328.0,1972.0,91.60,6037.0
14,0.0,0.0,171.0,6920.0,1973.0,255.17,6037.0

In [33]:
zillow_df.groupby(zillow_df.columns.tolist(),as_index=False).size() # check for duplicates

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips,size
0,0.0,0.0,1.0,28091.0,1963.0,439.55,6037.0,1
1,0.0,0.0,10.0,8033.0,1984.0,221.25,6037.0,1
2,0.0,0.0,20.0,22.0,2005.0,24.92,6037.0,2
3,0.0,0.0,20.0,1105.0,2005.0,61.82,6037.0,1
4,0.0,0.0,20.0,1124.0,2005.0,62.05,6037.0,2
...,...,...,...,...,...,...,...,...
2130209,16.0,16.0,7121.0,975000.0,1987.0,11218.15,6037.0,1
2130210,18.0,0.0,26116.0,20260690.0,2002.0,243003.64,6037.0,1
2130211,18.0,18.0,9309.0,2325000.0,1986.0,29283.87,6037.0,1
2130212,18.0,18.0,11134.0,2353308.0,1986.0,29165.39,6037.0,1
2130213,25.0,20.0,11700.0,1608491.0,2010.0,19238.87,6037.0,1

In [34]:
zillow_df = zillow_df.drop_duplicates() # drop the duplicates

In [35]:
zillow_df.to_csv('zillow.csv')# save to csv again. remember to delete the original one